#+SETUPFILE: https://fniessen.github.io/org-html-themes/setup/theme-readtheorg.setup
#+TITLE: Notes
#+AUTHOR: 陈小羽
#+LANGUAGE: en
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport
#+CREATOR: Emacs 26.1 (Org mode 9.2)

** Elisp中的数据结构中, 存储的是引用, 和python十分相似
   #+BEGIN_SRC elisp
	(setq test-list '(a b c d e f))
	(setcar (nthcdr 1 test-list) 'cxy)
	test-list
   #+END_SRC

   #+RESULTS:
   | a | cxy | c | d | e | f |

 Entered on [2019-02-09 Sat 00:20]
** Looping Exercise (info "(eintr) Looping exercise")
   1) Write a function similar to ‘triangle’ in which each row has a
	  value which is the square of the row number.  Use a ‘while’ loop.
	  #+BEGIN_SRC elisp
		(defun add-rows (num)
		  (let ((sum 0))
			(while (> num 0)
			  (setq sum (+ sum (* num num)))
			  (setq num (1- num)))
			sum))
		(add-rows 3)
	  #+END_SRC

	  #+RESULTS:
	  : 14
   2) Write a function similar to ‘triangle’ that multiplies instead of
	  adds the values.
	  #+BEGIN_SRC elisp
		(defun mul-row (num)
		  (let ((sum 1))
			(while (> num 0)
			  (setq sum (* sum num))
			  (setq num (1- num)))
			sum))
		(mul-row 3)
	  #+END_SRC

	  #+RESULTS:
	  : 6
   3) Rewrite these two functions recursively.  Rewrite these functions
	  using ‘cond’.
	  - add-rows
		#+BEGIN_SRC elisp
		  (defun add-rows-recur (num)
			(cond ((<= num 0) 0)
				  ((> num 0) (+ (add-rows-recur (1- num)) (* num num)))))
		  (add-rows-recur 3)
		#+END_SRC

		#+RESULTS:
		: 14
	  - mum-rows
		#+BEGIN_SRC elisp 
		  (defun mul-rows-recur (num)
			(cond ((<= num 1) 1)
				  ((> num 1) (* (mul-rows-recur (1- num)) num))))
		  (mul-rows-recur 3)
		#+END_SRC

		#+RESULTS:
		: 6
   4) Write a function for Texinfo mode that creates an index entry at
	  the beginning of a paragraph for every ‘@dfn’ within the paragraph.
	  (In a Texinfo file, ‘@dfn’ marks a definition.  This book is
	  written in Texinfo.)
	  #+BEGIN_SRC elisp
		(defun cxy-gen-index ()
		  "make the index for @dfn in Texinfo mode."
		  (interactive)
		  (save-excursion
			(save-restriction
			  (mark-paragraph)
			  (narrow-to-region (point) (mark))
			  (let ((dfn-counter 0)
					dfn-begin
					dfn-end)
				(while (search-forward "@dfn{" nil t) ; get the dfn into the kill-ring
				  (setq dfn-begin (point))
				  (search-forward "}" nil t)
				  (setq dfn-end (1- (point)))
				  (copy-region-as-kill dfn-begin dfn-end)
				  (setq dfn-counter (1+ dfn-counter)))
				(goto-char (point-min))
				(while (> dfn-counter 0)
				  (setq dfn-counter (1- dfn-counter))
				  (insert (car (nthcdr dfn-counter kill-ring)))
				  (insert "\n"))))))
	  #+END_SRC
